.. _kontonr_userguide:

kontonr Strings
============

Introduction
------------

The function :func:`clean_no_kontonr() <dataprep.clean.clean_no_kontonr.clean_no_kontonr>` cleans a column containing Norwegian bank account number (kontonr) strings, and standardizes them in a given format. The function :func:`validate_no_kontonr() <dataprep.clean.clean_no_kontonr.validate_no_kontonr>` validates either a single kontonr strings, a column of kontonr strings or a DataFrame of kontonr strings, returning `True` if the value is valid, and `False` otherwise.

kontonr strings can be converted to the following formats via the `output_format` parameter:

* `compact`: only number strings without any seperators or whitespace, like "86011117947"
* `standard`: kontonr strings with proper whitespace in the proper places, like "8601.11.17947"
* `iban`: convert the number to an IBAN, like "NO93 8601 11 17947".

Invalid parsing is handled with the `errors` parameter:

* `coerce` (default): invalid parsing will be set to NaN
* `ignore`: invalid parsing will return the input
* `raise`: invalid parsing will raise an exception

The following sections demonstrate the functionality of `clean_no_kontonr()` and `validate_no_kontonr()`.

### An example dataset containing kontonr strings

In [1]:
import pandas as pd
import numpy as np
df = pd.DataFrame(
    {
        "kontonr": [
            "8601 11 17947",
            "8601 11 17949",
            "999 999 999",
            "004085616",
            "002 724 334",
            "hello",
            np.nan,
            "NULL",
        ], 
        "address": [
            "123 Pine Ave.",
            "main st",
            "1234 west main heights 57033",
            "apt 1 789 s maple rd manhattan",
            "robie house, 789 north main street",
            "1111 S Figueroa St, Los Angeles, CA 90015",
            "(staples center) 1111 S Figueroa St, Los Angeles",
            "hello",
        ]
    }
)
df

         kontonr                                           address
0  8601 11 17947                                     123 Pine Ave.
1  8601 11 17949                                           main st
2    999 999 999                      1234 west main heights 57033
3      004085616                    apt 1 789 s maple rd manhattan
4    002 724 334                robie house, 789 north main street
5          hello         1111 S Figueroa St, Los Angeles, CA 90015
6            NaN  (staples center) 1111 S Figueroa St, Los Angeles
7           NULL                                             hello

## 1. Default `clean_no_kontonr`

By default, `clean_no_kontonr` will clean kontonr strings and output them in the standard format with proper separators.

In [2]:
from dataprep.clean import clean_no_kontonr
clean_no_kontonr(df, column = "kontonr")

,kontonr,address,kontonr_clean
0,8601 11 17947,123 Pine Ave.,8601.11.17947
1,8601 11 17949,main st,NaN
2,999 999 999,1234 west main heights 57033,NaN
3,004085616,apt 1 789 s maple rd manhattan,NaN
4,002 724 334,"robie house, 789 north main street",NaN
5,hello,"1111 S Figueroa St, Los Angeles, CA 90015",NaN
6,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
7,NULL,hello,NaN

## 2. Output formats

This section demonstrates the output parameter.

### `standard` (default)

In [3]:
clean_no_kontonr(df, column = "kontonr", output_format="standard")

,kontonr,address,kontonr_clean
0,8601 11 17947,123 Pine Ave.,8601.11.17947
1,8601 11 17949,main st,NaN
2,999 999 999,1234 west main heights 57033,NaN
3,004085616,apt 1 789 s maple rd manhattan,NaN
4,002 724 334,"robie house, 789 north main street",NaN
5,hello,"1111 S Figueroa St, Los Angeles, CA 90015",NaN
6,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
7,NULL,hello,NaN

### `compact`

In [4]:
clean_no_kontonr(df, column = "kontonr", output_format="compact")

,kontonr,address,kontonr_clean
0,8601 11 17947,123 Pine Ave.,86011117947
1,8601 11 17949,main st,NaN
2,999 999 999,1234 west main heights 57033,NaN
3,004085616,apt 1 789 s maple rd manhattan,NaN
4,002 724 334,"robie house, 789 north main street",NaN
5,hello,"1111 S Figueroa St, Los Angeles, CA 90015",NaN
6,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
7,NULL,hello,NaN

### `iban`

In [5]:
clean_no_kontonr(df, column = "kontonr", output_format="iban")

,kontonr,address,kontonr_clean
0,8601 11 17947,123 Pine Ave.,NO93 8601 11 17947
1,8601 11 17949,main st,NaN
2,999 999 999,1234 west main heights 57033,NaN
3,004085616,apt 1 789 s maple rd manhattan,NaN
4,002 724 334,"robie house, 789 north main street",NaN
5,hello,"1111 S Figueroa St, Los Angeles, CA 90015",NaN
6,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
7,NULL,hello,NaN

## 3. `inplace` parameter

This deletes the given column from the returned DataFrame. 
A new column containing cleaned kontonr strings is added with a title in the format `"{original title}_clean"`.

In [6]:
clean_no_kontonr(df, column="kontonr", inplace=True)

   kontonr_clean                                           address
0  8601.11.17947                                     123 Pine Ave.
1            NaN                                           main st
2            NaN                      1234 west main heights 57033
3            NaN                    apt 1 789 s maple rd manhattan
4            NaN                robie house, 789 north main street
5            NaN         1111 S Figueroa St, Los Angeles, CA 90015
6            NaN  (staples center) 1111 S Figueroa St, Los Angeles
7            NaN                                             hello

## 4. `errors` parameter

### `coerce` (default)

In [7]:
clean_no_kontonr(df, "kontonr", errors="coerce")

,kontonr,address,kontonr_clean
0,8601 11 17947,123 Pine Ave.,8601.11.17947
1,8601 11 17949,main st,NaN
2,999 999 999,1234 west main heights 57033,NaN
3,004085616,apt 1 789 s maple rd manhattan,NaN
4,002 724 334,"robie house, 789 north main street",NaN
5,hello,"1111 S Figueroa St, Los Angeles, CA 90015",NaN
6,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
7,NULL,hello,NaN

### `ignore`

In [8]:
clean_no_kontonr(df, "kontonr", errors="ignore")

,kontonr,address,kontonr_clean
0,8601 11 17947,123 Pine Ave.,8601.11.17947
1,8601 11 17949,main st,8601 11 17949
2,999 999 999,1234 west main heights 57033,999 999 999
3,004085616,apt 1 789 s maple rd manhattan,004085616
4,002 724 334,"robie house, 789 north main street",002 724 334
5,hello,"1111 S Figueroa St, Los Angeles, CA 90015",hello
6,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
7,NULL,hello,NaN

## 4. `validate_no_kontonr()`

`validate_no_kontonr()` returns `True` when the input is a valid kontonr. Otherwise it returns `False`.

The input of `validate_no_kontonr()` can be a string, a Pandas DataSeries, a Dask DataSeries, a Pandas DataFrame and a dask DataFrame.

When the input is a string, a Pandas DataSeries or a Dask DataSeries, user doesn't need to specify a column name to be validated. 

When the input is a Pandas DataFrame or a dask DataFrame, user can both specify or not specify a column name to be validated. If user specify the column name, `validate_no_kontonr()` only returns the validation result for the specified column. If user doesn't specify the column name, `validate_no_kontonr()` returns the validation result for the whole DataFrame.

In [9]:
from dataprep.clean import validate_no_kontonr
print(validate_no_kontonr("8601 11 17947"))
print(validate_no_kontonr("8601 11 17949"))
print(validate_no_kontonr("999 999 999"))
print(validate_no_kontonr("51824753556"))
print(validate_no_kontonr("004085616"))
print(validate_no_kontonr("hello"))
print(validate_no_kontonr(np.nan))
print(validate_no_kontonr("NULL"))

True
False
False
False
False
False
False
False

### Series

In [10]:
validate_no_kontonr(df["kontonr"])

0     True
1    False
2    False
3    False
4    False
5    False
6    False
7    False
Name: kontonr, dtype: bool

### DataFrame + Specify Column

In [11]:
validate_no_kontonr(df, column="kontonr")

0     True
1    False
2    False
3    False
4    False
5    False
6    False
7    False
Name: kontonr, dtype: bool

### Only DataFrame

In [12]:
validate_no_kontonr(df)

   kontonr  address
0     True    False
1    False    False
2    False    False
3    False    False
4    False    False
5    False    False
6    False    False
7    False    False